#### Terraform - Formatação e Estilo 🖌`success`
#### Terraform Init ⚙️`success`
#### Terraform Validação 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Detalhes do Terraform Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.repositorio_api will be created
  + resource "aws_ecr_repository" "repositorio_api" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "tc-soat10-ecr-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "project"   = "tc-infra"
          + "terraform" = "true"
        }
    }

  # aws_ecr_repository.repositorio_webhook will be created
  + resource "aws_ecr_repository" "repositorio_webhook" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "tc-soat10-ecr-webhook"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "project"   = "tc-infra"
          + "terraform" = "true"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_api     = (known after apply)
  + ecr_webhook = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Enviado por: @ronanluiz, Action: `pull_request`*